session3/OF6-session3/CBAneurysm/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];// p/rho = m2/s2

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            zeroGradient;
    }

    outletTop
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    outletBottom
    {
        type            fixedValue;
        value           uniform 0.0;
    }
/*
    AneurysmWall
    {
        type            zeroGradient;
    }

    vesselWall
    {
        type            zeroGradient;
    }
*/
    frontAndBackPlanes
    {
        type            empty;
    }

    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
