session3/OF6-session3/CBAneurysm/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type 			sets;
libs            	("libsampling.so");

writeControl    	writeTime;
interpolationScheme 	cellPoint;
setFormat       	raw;

sets
(
    data
    {
        type    lineFace;//lineUniform;
        axis    x;
        start   (0 0 0);
        end     (0.04 0 0);
        nPoints 50;
    }
);

fields          (p U);//U.component(0) mag(U)

// ************************************************************************* //
